"""
*Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре. В кортеже должно быть два
элемента — номер товара и словарь с параметрами, то есть характеристиками товара:
название, цена, количество, единица измерения. Структуру нужно сформировать программно,
запросив все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Нужно собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ —
характеристика товара, например, название. Тогда значение — список
значений-характеристик, например, список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""

# catalog = [
#     (1, {"название": "компьютер", "цена": 20000, "количество": 5, "единица измерения": "шт"}),
#     (2, {"название": "принтер", "цена": 6000, "количество": 2, "единица измерения": "шт"}),
#     (3, {"название": "сканер", "цена": 2000, "количество": 7, "единица измерения": "шт"}),
#     (4, {"название": "бумага", "цена": 2000, "количество": 2, "единица измерения": "пачка"}),
#     (1, {"название": "компьютер", "цена": 30000, "количество": 2, "единица измерения": "шт"}),
# ]

dict_properties = {"название": {}, "цена": {}, "количество": {}, "единица измерения": {}}
list_properties = ["название", "цена", "количество", "единица измерения"]
catalog = []

while True:
    if int(input("Добавть товар (да = 1, нет = 0): ")) == 0:
        break

    product_name = input("Введите наименование товара: ")
    product_cost = int(input("Введите цену товара: "))
    product_amount = int(input("Введите количество товара: "))
    product_unit = input("Введите единицу измерения товара: ")
    catalog.append((len(catalog) + 1, {"название": product_name, "цена": product_cost, "количество": product_amount,
                                       "единица измерения": product_unit}))

for x in catalog:
    print(x)

print("\n")

for item in catalog:
    for properties in list_properties:
        # print(item[1].get(properties))
        current_properties = dict_properties.get(properties)
        current_item = item[1].get(properties)
        # print(current_item)
        current_properties[current_item] = current_properties.get(current_item, 0) + 1
        dict_properties[properties] = current_properties

for report_items in dict_properties:
    print(f"{report_items + ' ':-<40}")
    for report_item_key, report_item_values in dict_properties.get(report_items).items():
        print(f"   {report_item_key:>30} = {report_item_values}")

print("\n")
print(dict_properties)
